new Vue({
  el: '#app',
  data() {
    return {
      ProfessionalCertificates: [
        {
          id: 1,
          name: "CCNA 200-301 شهادة سيسكو المعتمدة",
          description: "، تمنحك دورة تنفيذ وإدارة حلول Cisco (CCNA) مجموعة واسعة من المعرفة الأساسية لجميع وظائف تكنولوجيا المعلومات. من خلال مجموعة من المحاضرات والمختبرات العملية والدراسة الذاتية ، ستتعلم كيفية تثبيت شبكات IPv4 و IPv6 الأساسية وتشغيلها وتكوينها والتحقق منها. تغطي الدورة تكوين مكونات الشبكة مثل المفاتيح والموجهات ووحدات التحكم في الشبكة المحلية اللاسلكية. إدارة أجهزة الشبكة ؛ وتحديد التهديدات الأمنية الأساسية. تمنحك الدورة أيضًا أساسًا في قابلية برمجة الشبكة والأتمتة والشبكات المعرفة بالبرمجيات.الأحد الموافق 2025/04/06	من 06:00 مساءً حتى 08:30 مساءً",
          image: "./src/assets/images/CCNA 200-301.png",
          category: "ProfessionalCertificates",
          link: "https://abadnet.com.sa/ccna-200-301",
          showDescription: false  // حالة إخفاء/إظهار الوصف
        },
        {
          id: 2,
          name: "CompTIA Security+ أســاسيات أمن المعلومات",
          description: "تبدأ الدورة : يوم الأحد| الموافق 2025/04/06 - هي أول هي أول شهادة أمنية يجب أن تكسبها في مجال أمن المعلومات أو الأمن السيبراني وتغطي مجموعة واسعة من ممارسات الأمان للمبتدئين وتساعد على بناء شبكات وأنظمة أكثر أمانًا . تحظى باحترام واسع باعتبارها شهادة أمان للمبتدئين ومعترف بها دولياً . سيساعدك اجتياز الإمتحان أو حتى حضور الدورة فقط على الاقتراب من هدفك في أن تصبح محترفًا في مجال الأمن . حتى إذا لم يكن هذا هو المسار الذي قررت أن تسلكه في النهاية يجب أن يكون الأمان متأصلًا في كل جانب من جوانب تكنولوجيا المعلومات .",
          image: "./src/assets/images/CompTIA Security.png",
          category: "ProfessionalCertificates",
          link: "https://abadnet.com.sa/security",
          showDescription: false
        },
        {
          id: 3,
          name: "PMP – Project Management Professiona دورة إدارة المشاريع الإحترافية",
          description:" تبدأ الدورة : يوم الجمعة| الموافق 2025/04/11 تعرف إدارة ادارة المشاريع الاحترافية Project Management Professional على أنها تخصّص يتعلّق بعملية تنظيم وإدارة الموارد المتاحة في المشاريع ، مثل : الموارد البشريّة أو الموارد المادية ، بطريقة يمكن من خلالها إنجاز المشروع بنجاح في ظل مراعاة عوامل الجودة والوقت والتكلفة المتاحة. تلك الدورة مصصمة للحصول على خبرات أعمق لتزيد من قدرتك في إدارة المشاريع بكفاءة أعلى. حيث إن هذه دورة معتمدة من معهد إدارة المشاريع PMI لذلك تعتبر دورة محترف إدارة المشاريع من أكثر الشهادات طلبًا لأنها تُمكن مديرو المشاريع من تعزيز معرفتهم وتنمية مهاراتهم الإدارية والقيادية بالإضافة إلى التعرف على استراتيجيات ومنهجيات إدارة المشاريع وكيفية تطبيقها بفاعلية داخل المؤسسات.",
          image: "./src/assets/images/PMP.png",
          category: "ProfessionalCertificates",
          link: "https://abadnet.com.sa/pmp-project-management-professiona",
          showDescription: false
        }
      ]
    };
  },
  methods: {
    toggleDescription(ProfessionalCertificates) {
      ProfessionalCertificates.showDescription = !ProfessionalCertificates.showDescription;
    }
  }
});
